{
  "AboutPage.seo.title": "About Us | HeyTCM",
  "AboutPage.seo.description": "HeyTCM is dedicated to advancing the digitalization and intelligence of Traditional Chinese Medicine.",
  "AboutPage.seo.keywords": "TCM, digitalization, intelligence, HeyTCM",
  "AboutPage.seo.og.title": "About Us | HeyTCM",
  "AboutPage.seo.og.description": "HeyTCM is dedicated to advancing the digitalization and intelligence of Traditional Chinese Medicine.",
  "AboutPage.seo.og.site_name": "HeyTCM",
  "AboutPage.seo.og.image": "https://heytcm.com/og-image.jpg",
  "AboutPage.seo.canonical": "https://heytcm.com/about",
  "AboutPage.seo.alternate.x-default": "https://heytcm.com/about",
  "AboutPage.seo.alternate.zh": "https://heytcm.com/zh/about",
  "AboutPage.seo.alternate.en": "https://heytcm.com/en/about",
  "AboutPage.head.title": "HeyTCM - About Us",
  "AboutPage.banner.title": "Our Story: Inheriting and Innovating TCM Wisdom",
  "AboutPage.banner.image": "Founder Story Main Image",
  "AboutPage.ldjson.type": "AboutPage",
  "AboutPage.ldjson.mainEntity.type": "Organization",
  "AboutPage.ldjson.mainEntity.name": "HeyTCM",
  "AboutPage.ldjson.mainEntity.url": "https://heytcm.com/",
  "AboutPage.ldjson.mainEntity.description": "HeyTCM is dedicated to advancing the digitalization and intelligence of Traditional Chinese Medicine.",
  "AboutPage.sections": [
    {
      "type": "story",
      "title": "From Mountain Child to TCM Explorer: Sheng Haiwang and the Origin of HeyTCM",
      "body": [
        {
          "title": "Body's 'Alarm' and Unsolved Confusion",
          "para": "I was born in a remote mountain village and was frail and sickly since childhood. Bedwetting was a constant companion—until the age of 10, I often woke up to a cold, wet bed. Back then, I couldn't understand the signals my body was sending, enduring both my peers' ridicule and my own shame."
        },
        {
          "para": "After entering university, issues like sensitive digestion and hand tremors followed. I kept asking myself: 'What's wrong with me? Why does my seemingly normal body have so many discomforts I can't explain to others?'"
        },
        {
          "title": "A Medical Coder's Journey of Exploration",
          "para": "My career choice seemed destined. I became a software engineer in the healthcare sector, developing countless health systems and products over 15 years. Ironically, while I could help build systems to solve others' health problems, I couldn't understand my own body's language."
        },
        {
          "para": "At 35, chronic urticaria and insomnia severely affected my quality of life. Western medicine found nothing abnormal, and medication was ineffective. By chance, I encountered traditional TCM theory and began to study Qi and Blood, as well as the interrelations of the five organs. I discovered that TCM's holistic and balance concepts offered a new framework to explain my long-standing physical issues."
        },
        {
          "title": "Aspired Mission: Illuminating TCM Wisdom with Technology",
          "para": "As my understanding of TCM deepened, one idea became clear: the precious wisdom of TCM is being marginalized in modern society—not because it is ineffective, but because it lacks a modern, accessible expression."
        },
        {
          "para": "In the past, TCM practitioners relied on years of experience in 'inspection, listening, inquiry, and palpation.' Can we now leverage technology—data collection and intelligent analysis—to make this process more objective? Can ancient theories like Qi, Blood, Yin, and Yang be quantified with modern sensors, revealing the scientific value of TCM to more people?"
        },
        {
          "para": "With these thoughts, I founded HeyTCM, hoping to connect ancient TCM wisdom with modern technological innovation, providing new health perspectives and solutions for those confused by their bodies."
        }
      ]
    },
    {
      "type": "vision",
      "title": "Our Vision",
      "body": [
        {
          "title": "Vision 1: Digitalizing TCM",
          "para": "Promoting the digitalization and intelligence of TCM, so more people can benefit from its science and warmth."
        },
        {
          "title": "Vision 2: Empowered by Technology"
        }
      ],
      "items": [
        {
          "title": "Intelligent Health Management",
          "para": "Enhancing the scientific nature of health management with data and algorithms."
        },
        {
          "title": "Open Ecosystem",
          "para": "Building an open, collaborative digital TCM ecosystem."
        },
        {
          "title": "User First",
          "para": "Putting user needs at the core driving force."
        },
        {
          "title": "Inheriting and Innovating",
          "para": "Integrating traditional wisdom with modern technology, innovating TCM expressions."
        }
      ]
    }
  ],
  "AboutPage.cta.title": "Join Us and Start Your Health Journey",
  "AboutPage.cta.description": "Become a member of the HeyTCM community and experience the most cutting-edge intelligent TCM products and services.",
  "AboutPage.cta.buttonText": "Join Now"
}

